dct = {}
dct['학번'] = input("학번 입력: ")
dct['이름'] = input("이름 입력: ")
dct['국어'] = int(input("국어 점수 입력: "))
dct['영어'] = int(input("영어 점수 입력: "))
dct['수학'] = int(input("수학 점수 입력: "))
dct['총점'] = dct['국어'] + dct['영어'] + dct['수학']
dct['평균'] = dct['총점'] / 3

if 90 <= dct['평균']:
    dct['rank'] = '수'
elif 80 <= dct['평균']:
    dct['rank'] = '우'
elif 70 <= dct['평균']:
    dct['rank'] = '미'
elif 60 <= dct['평균']:
    dct['rank'] = '양'
else:
    dct['rank'] = '가'

print("\n\t\t\t***성적표***")
print("===========================================")
print("학번   이름   국어  영어  수학  총점  평균  등급")
print("===========================================")
print("%4s %4s %4d %4d %4d %4d %5.2f %3s"
      % (dct['학번'], dct['이름'], dct['국어'], dct['영어'], dct['수학'], dct['총점'], dct['평균'], dct['rank']))
print("===========================================")